#include <stdio.h>
#pragma warning(disable: 4996)	//添加的定义排除警告

/*
****************************************

有一头母牛，它每年年初生一头小母牛。
每头小母牛从第四个年头开始，
每年年初也生一头小母牛。
请编程实现在第n年的时候，共有多少头母牛？

****************************************
*/

int main(void)
{
	int N,sum=1,a[3];
	while(scanf("%d",&N) != EOF)
	{
		if(N==0)
			break;
		s[0]=s[1]=s[2]=0;
		s[3]=1;
		for (i=1;i<N;i++)
		{
			s[3]=s[3]+s[2];
			s[2]=s[1];
			s[1]=s[0];
			s[0]=s[3];
		}
		sum =s[0]+s[1]+s[2]+s[3];
		printf("%d\n",sum);
		
	}
	return 0;
}