#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#pragma warning(disable: 4996)	//添加的定义排除警告

/*
***************************************************

古希腊数学家毕达哥拉斯在自然数研究中发现，220的所有真约数(即不是自身的约数)之和为： 
1+2+4+5+10+11+20+22+44+55+110＝284。 
而284的所有真约数为1、2、4、71、 142，加起来恰好为220。称之为亲和数
一般地讲，如果两个数中任何一个数都是另一个数的真约数之和，则这两个数就是亲和数

输入数据第一行包含一个数M，接下有M行，每行一个实例,包含两个整数A,B； 其中 0 <= A,B <= 600000 ;

对于每个测试实例，如果A和B是亲和数的话输出YES，否则输出NO。
***************************************************
*/

int main() 
{
	int N, a, b;
	while (scanf("%d", &N) == 1 && N)
	{
		int sum1 = 0, sum2 = 0;
		for (int i = 0; i < N; i++)
		{
			scanf("%d%d", &a, &b);
			sum1 = 0, sum2 = 0;			//每次循环需要将变量清零
			for (int i = 1; i<a; i++)
			if (a%i == 0)
				sum1 += i;

			for (int i = 1; i<b; i++)
			if (b%i == 0)
				sum2 += i;
			if (sum1 == b && sum2 == a)
				printf("YES\n");
			else
				printf("NO\n");
		}
	}
	return 0;
}