#include <string.h>
#include <stdlib.h>
#include <math.h>
#include <stdio.h>
#pragma warning(disable: 4996)	//添加的定义排除警告
/**
输入文件将由几种情况组成。每种情况首先由整数n（1 <= n <1000000，n为奇数）呈现。 
n个正整数将以一行的形式给出，所有的整数都将小于2 ^ 31。 这些数字表示presents.n = 0的卡号结束输入。
输出一行中的整数，这是你当前的卡号。
5
1 1 3 2 2
3
1 2 1
0

----------
3
2

核心：a ^a=0;a^0=a;


异或运算符的用法：
整数的异或是先把它们化成二进制，再按位异或。比如3^5,     3=011,5=101,两数按位异或后为110，即6。
      几个数异或满足交换律。2^3^2=2^2^3=0^3=3.
      两个相同的数异或为0，普通数都出现了偶数次，所以它们异或后都是0，而0与那个特别数异或后还是那个特殊数。
**/
int main()
{
	int N, i, a, sum = 0;
	while (scanf("%d", &N) == 1 && N)
	{
		scanf("%d", &sum);
		N--;
		while (N--)
		{
		//	for (i = 0; i<N; i++)
				scanf("%d", &a);
			sum ^= a;		//几个数异或满足交换律:	2^3^2=2^2^3=0^3=3
		}
		printf("%d\n", sum);
	}
	return 0;
}